const REGIONSALT = {
    "SEO": {
        name: [ "서울시", "서울", "특별시" ],
        sub: {}
    },
    "BUS": {
        name: [ "부산시", "부산", "광역시" ],
        sub: {
            "BUS": {
                name: [ null, null, "시내지구" ],
                sub: {}
            },
            "DRA": {
                name: [ "기장군", "기장", "군" ],
                sub: {}
            }
        }
    },
    "DAE": {
        name: [ "대구시", "대구", "광역시" ],
        sub: {
            "DAE": {
                name: [ null, null, "시내지구" ],
                sub: {}
            },
            "DAL": {
                name: [ "달성군", "달성", "군" ],
                sub: {}
            },
            "GWI": {
                name: [ "군위군", "군위", "군" ],
                sub: {}
            }
        }
    },
    "INC": {
        name: [ "인천시", "인천", "광역시" ],
        sub: {
            "INC": {
                name: [ null, null, "시내지구" ],
                sub: {}
            },
            "GHW": {
                name: [ "강화군", "강화", "군" ],
                sub: {}
            },
            "OJI": {
                name: [ "옹진군", "옹진", "군" ],
                sub: {}
            }
        }
    },
    "GWJ": {
        name: [ "광주시", "광주", "광역시" ],
        sub: {}
    },
    "DJN": {
        name: [ "대전시", "대전", "광역시" ],
        sub: {}
    },
    "ULS": {
        name: [ "울산시", "울산", "광역시" ],
        sub: {
            "ULS": {
                name: [ null, null, "시내지구" ],
                sub: {}
            },
            "ULJ": {
                name: [ "울주군", "울주", "군" ],
                sub: {}
            }
        }
    },
    "SEJ": {
        name: [ "세종시", "세종", "특별자치시" ],
        sub: {}
    },
    "SGG": {
        name: [ "경기도", "경기", "도" ],
        sub: {
            "GOY": {
                name: [ "고양시", "고양", "시" ],
                sub: {}
            },
            "SUW": {
                name: [ "수원시", "수원", "시" ],
                sub: {}
            },
            "YIN": {
                name: [ "용인시", "용인", "시" ],
                sub: {}
            },
            "GCN": {
                name: [ "과천시", "과천", "시" ],
                sub: {}
            },
            "GWM": {
                name: [ "광명시", "광명", "시" ],
                sub: {}
            },
            "GGJ": {
                name: [ "광주시", "광주", "시" ],
                sub: {}
            },
            "GRI": {
                name: [ "구리시", "구리", "시" ],
                sub: {}
            },
            "GNP": {
                name: [ "군포시", "군포", "시" ],
                sub: {}
            },
            "GMP": {
                name: [ "김포시", "김포", "시" ],
                sub: {}
            },
            "NAM": {
                name: [ "남양주시", "남양주", "시" ],
                sub: {}
            },
            "DDC": {
                name: [ "동두천시", "동두천", "시" ],
                sub: {}
            },
            "BUC": {
                name: [ "부천시", "부천", "시" ],
                sub: {}
            },
            "SNM": {
                name: [ "성남시", "성남", "시" ],
                sub: {}
            },
            "SIH": {
                name: [ "시흥시", "시흥", "시" ],
                sub: {}
            },
            "ANS": {
                name: [ "안산시", "안산", "시" ],
                sub: {}
            },
            "ASN": {
                name: [ "안성시", "안성", "시" ],
                sub: {}
            },
            "ANY": {
                name: [ "안양시", "안양", "시" ],
                sub: {}
            },
            "YNJ": {
                name: [ "양주시", "양주", "시" ],
                sub: {}
            },
            "YEJ": {
                name: [ "여주시", "여주", "시" ],
                sub: {}
            },
            "OSN": {
                name: [ "오산시", "오산", "시" ],
                sub: {}
            },
            "UIW": {
                name: [ "의왕시", "의왕", "시" ],
                sub: {}
            },
            "UIJ": {
                name: [ "의정부시", "의정부", "시" ],
                sub: {}
            },
            "ICH": {
                name: [ "이천시", "이천", "시" ],
                sub: {}
            },
            "PAJ": {
                name: [ "파주시", "파주", "시" ],
                sub: {}
            },
            "PTK": {
                name: [ "평택시", "평택", "시" ],
                sub: {}
            },
            "PCH": {
                name: [ "포천시", "포천", "시" ],
                sub: {}
            },
            "HAN": {
                name: [ "하남시", "하남", "시" ],
                sub: {}
            },
            "HWA": {
                name: [ "화성시", "화성", "시" ],
                sub: {}
            },
            "GAP": {
                name: [ "가평군", "가평", "군" ],
                sub: {}
            },
            "YNP": {
                name: [ "양평군", "양평", "군" ],
                sub: {}
            },
            "YCN": {
                name: [ "연천군", "연천", "군" ],
                sub: {}
            },
        }
    },
    "NCC": {
        name: [ "충청북도", "충북", "도" ],
        sub: {
            "JEC": {
                name: [ "제천시", "제천", "시" ],
                sub: {}
            },
            "CEJ": {
                name: [ "청주시", "청주", "시" ],
                sub: {}
            },
            "CUJ": {
                name: [ "충주시", "충주", "시" ],
                sub: {}
            },
            "GOE": {
                name: [ "괴산군", "괴산", "군" ],
                sub: {}
            },
            "DAN": {
                name: [ "단양군", "단양", "군" ],
                sub: {}
            },
            "BON": {
                name: [ "보은군", "보은", "군" ],
                sub: {}
            },
            "YDN": {
                name: [ "영동군", "영동", "군" ],
                sub: {}
            },
            "OKC": {
                name: [ "옥천군", "옥천", "군" ],
                sub: {}
            },
            "EUM": {
                name: [ "음성군", "음성", "군" ],
                sub: {}
            },
            "JUN": {
                name: [ "증평군", "증평", "군" ],
                sub: {}
            },
            "JIN": {
                name: [ "진천군", "진천", "군" ],
                sub: {}
            }
        }
    },
    "SCC": {
        name: [ "충청남도", "충남", "도" ],
        sub: {
            "GRY": {
                name: [ "계룡시", "계룡", "시" ],
                sub: {}
            },
            "GGJ": {
                name: [ "공주시", "공주", "시" ],
                sub: {}
            },
            "NNN": {
                name: [ "논산시", "논산", "시" ],
                sub: {}
            },
            "DJI": {
                name: [ "당진시", "당진", "시" ],
                sub: {}
            },
            "BRY": {
                name: [ "보령시", "보령", "시" ],
                sub: {}
            },
            "SES": {
                name: [ "서산시", "서산", "시" ],
                sub: {}
            },
            "ASA": {
                name: [ "아산시", "아산", "시" ],
                sub: {}
            },
            "CAN": {
                name: [ "천안시", "천안", "시" ],
                sub: {}
            },
            "GSA": {
                name: [ "금산군", "금산", "군" ],
                sub: {}
            },
            "BYO": {
                name: [ "부여군", "부여", "군" ],
                sub: {}
            },
            "SEO": {
                name: [ "서천군", "서천", "군" ],
                sub: {}
            },
            "YSA": {
                name: [ "예산군", "예산", "군" ],
                sub: {}
            },
            "CHY": {
                name: [ "청양군", "청양", "군" ],
                sub: {}
            },
            "TAE": {
                name: [ "태안군", "태안", "군" ],
                sub: {}
            },
            "HNS": {
                name: [ "홍성군", "홍성", "군" ],
                sub: {}
            }
        }
    },
    "NJE": {
        name: [ "전라북도", "전북", "특별자치도" ],
        sub: {
            "GUN": {
                name: [ "군산시", "군산", "시" ],
                sub: {}
            },
            "GIJ": {
                name: [ "김제시", "김제", "시" ],
                sub: {}
            },
            "NWO": {
                name: [ "남원시", "남원", "시" ],
                sub: {}
            },
            "IKS": {
                name: [ "익산시", "익산", "시" ],
                sub: {}
            },
            "JNJ": {
                name: [ "전주시", "전주", "시" ],
                sub: {}
            },
            "JGP": {
                name: [ "정읍시", "정읍", "시" ],
                sub: {}
            },
            "GCH": {
                name: [ "고창군", "고창", "군" ],
                sub: {}
            },
            "MUJ": {
                name: [ "무주군", "무주", "군" ],
                sub: {}
            },
            "BUA": {
                name: [ "부안군", "부안", "군" ],
                sub: {}
            },
            "SUC": {
                name: [ "순창군", "순창", "군" ],
                sub: {}
            },
            "WAN": {
                name: [ "완주군", "완주", "군" ],
                sub: {}
            },
            "IMS": {
                name: [ "임실군", "임실", "군" ],
                sub: {}
            },
            "JAS": {
                name: [ "장수군", "장수", "군" ],
                sub: {}
            },
            "JAN": {
                name: [ "진안군", "진안", "군" ],
                sub: {}
            }
        }
    },
    "SJE": {
        name: [ "전라남도", "전남", "도" ],
        sub: {
            "MOK": {
                name: [ "목포시", "목포", "시" ],
                sub: {}
            },
            "YSU": {
                name: [ "여수시", "여수", "시" ],
                sub: {}
            },
            "SUN": {
                name: [ "순천시", "순천", "시" ],
                sub: {}
            },
            "NAJ": {
                name: [ "나주시", "나주", "시" ],
                sub: {}
            },
            "GWY": {
                name: [ "광양시", "광양", "시" ],
                sub: {}
            },
            "DMY": {
                name: [ "담양군", "담양", "군" ],
                sub: {}
            },
            "GOK": {
                name: [ "곡성군", "곡성", "군" ],
                sub: {}
            },
            "GUR": {
                name: [ "구례군", "구례", "군" ],
                sub: {}
            },
            "GOH": {
                name: [ "고흥군", "고흥", "군" ],
                sub: {}
            },
            "BOS": {
                name: [ "보성군", "보성", "군" ],
                sub: {}
            },
            "HWS": {
                name: [ "화순군", "화순", "군" ],
                sub: {}
            },
            "JAH": {
                name: [ "장흥군", "장흥", "군" ],
                sub: {}
            },
            "GJI": {
                name: [ "강진군", "강진", "군" ],
                sub: {}
            },
            "HAE": {
                name: [ "해남군", "해남", "군" ],
                sub: {}
            },
            "YAM": {
                name: [ "영암군", "영암", "군" ],
                sub: {}
            },
            "MAN": {
                name: [ "무안군", "무안", "군" ],
                sub: {}
            },
            "HPY": {
                name: [ "함평군", "함평", "군" ],
                sub: {}
            },
            "YGW": {
                name: [ "영광군", "영광", "군" ],
                sub: {}
            },
            "JSO": {
                name: [ "장성군", "장성", "군" ],
                sub: {}
            },
            "WDO": {
                name: [ "완도군", "완도", "군" ],
                sub: {}
            },
            "JDO": {
                name: [ "진도군", "진도", "군" ],
                sub: {}
            },
            "SIA": {
                name: [ "신안군", "신안", "군" ],
                sub: {}
            }
        }
    },
    "NGS": {
        name: [ "경상북도", "경북", "도" ],
        sub: {
            "GES": {
                name: [ "경산시", "경산", "시" ],
                sub: {}
            },
            "WOL": {
                name: [ "경주시", "경주", "시" ],
                sub: {}
            },
            "GUM": {
                name: [ "구미시", "구미", "시" ],
                sub: {}
            },
            "GIM": {
                name: [ "김해시", "김해", "시" ],
                sub: {}
            },
            "JMC": {
                name: [ "문경시", "문경", "시" ],
                sub: {}
            },
            "SJU": {
                name: [ "상주시", "상주", "시" ],
                sub: {}
            },
            "AND": {
                name: [ "안동시", "안동", "시" ],
                sub: {}
            },
            "YGJ": {
                name: [ "영주시", "영주", "시" ],
                sub: {}
            },
            "YCN": {
                name: [ "영천시", "영천", "시" ],
                sub: {}
            },
            "POH": {
                name: [ "포항시", "포항", "시" ],
                sub: {}
            },
            "GRG": {
                name: [ "고령군", "고령", "군" ],
                sub: {}
            },
            "BHW": {
                name: [ "봉화군", "봉화", "군" ],
                sub: {}
            },
            "SGU": {
                name: [ "성주군", "성주", "군" ],
                sub: {}
            },
            "YDK": {
                name: [ "영덕군", "영덕", "군" ],
                sub: {}
            },
            "YYG": {
                name: [ "영양군", "영양", "군" ],
                sub: {}
            },
            "YEC": {
                name: [ "예천군", "예천", "군" ],
                sub: {}
            },
            "ULL": {
                name: [ "울릉군", "울릉", "군" ],
                sub: {}
            },
            "UJN": {
                name: [ "울진군", "울진", "군" ],
                sub: {}
            },
            "UIG": {
                name: [ "의성군", "의성", "군" ],
                sub: {}
            },
            "CDO": {
                name: [ "청도군", "청도", "군" ],
                sub: {}
            },
            "CON": {
                name: [ "청송군", "청송", "군" ],
                sub: {}
            },
            "COK": {
                name: [ "칠곡군", "칠곡", "군" ],
                sub: {}
            }
        }
    },
    "SGS": {
        name: [ "경상남도", "경남", "도" ],
        sub: {
            "CWN": {
                name: [ "창원시", "창원", "시" ],
                sub: {}
            },
            "GJE": {
                name: [ "거제시", "거제", "시" ],
                sub: {}
            },
            "GAE": {
                name: [ "김해시", "김해", "시" ],
                sub: {}
            },
            "MRY": {
                name: [ "밀양시", "밀양", "시" ],
                sub: {}
            },
            "SAC": {
                name: [ "사천시", "사천", "시" ],
                sub: {}
            },
            "YAS": {
                name: [ "양산시", "양산", "시" ],
                sub: {}
            },
            "JIJ": {
                name: [ "진주시", "진주", "시" ],
                sub: {}
            },
            "CHM": {
                name: [ "통영시", "통영", "시" ],
                sub: {}
            },
            "GEC": {
                name: [ "거창군", "거창", "군" ],
                sub: {}
            },
            "GSE": {
                name: [ "고성군", "고성", "군" ],
                sub: {}
            },
            "NHE": {
                name: [ "남해군", "남해", "군" ],
                sub: {}
            },
            "SCG": {
                name: [ "산청군", "산청", "군" ],
                sub: {}
            },
            "URY": {
                name: [ "의령군", "의령", "군" ],
                sub: {}
            },
            "NYE": {
                name: [ "창녕군", "창녕", "군" ],
                sub: {}
            },
            "HAD": {
                name: [ "하동군", "하동", "군" ],
                sub: {}
            },
            "HMN": {
                name: [ "함안군", "함안", "군" ],
                sub: {}
            },
            "HYG": {
                name: [ "함양군", "함양", "군" ],
                sub: {}
            },
            "PCH": {
                name: [ "합천군", "합천", "군" ],
                sub: {}
            }
        }
    },
    "GWN": {
        name: [ "강원도", "강원", "특별자치도" ],
        sub: {
            "GGG": {
                name: [ "강릉시", "강릉", "시" ],
                sub: {}
            },
            "DHE": {
                name: [ "동해시", "동해", "시" ],
                sub: {}
            },
            "SAK": {
                name: [ "삼척시", "삼척", "시" ],
                sub: {}
            },
            "SKC": {
                name: [ "속초시", "속초", "시" ],
                sub: {}
            },
            "WON": {
                name: [ "원주시", "원주", "시" ],
                sub: {}
            },
            "CCH": {
                name: [ "춘천시", "춘천", "시" ],
                sub: {}
            },
            "TBK": {
                name: [ "태백시", "태백", "시" ],
                sub: {}
            },
            "GSO": {
                name: [ "고성군", "고성", "군" ],
                sub: {}
            },
            "YGG": {
                name: [ "양구군", "양구", "군" ],
                sub: {}
            },
            "YYG": {
                name: [ "양양군", "양양", "군" ],
                sub: {}
            },
            "YWL": {
                name: [ "영월군", "영월", "군" ],
                sub: {}
            },
            "INJ": {
                name: [ "인제군", "인제", "군" ],
                sub: {}
            },
            "JSN": {
                name: [ "정선군", "정선", "군" ],
                sub: {}
            },
            "CRW": {
                name: [ "철원군", "철원", "군" ],
                sub: {}
            },
            "PYC": {
                name: [ "평창군", "평창", "군" ],
                sub: {}
            },
            "HCH": {
                name: [ "홍천군", "홍천", "군" ],
                sub: {}
            },
            "HWH": {
                name: [ "화천군", "화천", "군" ],
                sub: {}
            },
            "HOE": {
                name: [ "횡성군", "횡성", "군" ],
                sub: {}
            }
        }
    },
    "JJU": {
        name: [ "제주도", "제주", "특별자치도" ],
        sub: {
            "JCT": {
                name: [ "제주시", "제주", "시" ],
                sub: {}
            },
            "GWP": {
                name: [ "서귀포시", "서귀포", "시" ],
                sub: {}
            },
        }
    }
}