const REGIONSALT = {
    "SEO": {
        name: [ "서울시", "서울", "특별시" ],
        sub: {
            "DIS0": {
                name: [ "종로구", "종로", "구" ],
                sub: {}
            },
            "DIS1": {
                name: [ "중구", "중", "구" ],
                sub: {}
            },
            "DIS2": {
                name: [ "용산구", "용산", "구" ],
                sub: {}
            },
            "DIS3": {
                name: [ "성동구", "성동", "구" ],
                sub: {}
            },
            "DIS4": {
                name: [ "광진구", "광진", "구" ],
                sub: {}
            },
            "DIS5": {
                name: [ "동대문구", "동대문", "구" ],
                sub: {}
            },
            "DIS6": {
                name: [ "중랑구", "중랑", "구" ],
                sub: {}
            },
            "DIS7": {
                name: [ "성북구", "성북", "구" ],
                sub: {}
            },
            "DIS8": {
                name: [ "강북구", "강북", "구" ],
                sub: {}
            },
            "DIS9": {
                name: [ "도봉구", "도봉", "구" ],
                sub: {}
            },
            "DIS10": {
                name: [ "노원구", "노원", "구" ],
                sub: {}
            },
            "DIS11": {
                name: [ "은평구", "은평", "구" ],
                sub: {}
            },
            "DIS12": {
                name: [ "서대문구", "서대문", "구" ],
                sub: {}
            },
            "DIS13": {
                name: [ "마포구", "마포", "구" ],
                sub: {}
            },
            "DIS14": {
                name: [ "양천구", "양천", "구" ],
                sub: {}
            },
            "DIS15": {
                name: [ "강서구", "강서", "구" ],
                sub: {}
            },
            "DIS16": {
                name: [ "구로구", "구로", "구" ],
                sub: {}
            },
            "DIS17": {
                name: [ "금천구", "금천", "구" ],
                sub: {}
            },
            "DIS18": {
                name: [ "영등포구", "영등포", "구" ],
                sub: {}
            },
            "DIS19": {
                name: [ "동작구", "동작", "구" ],
                sub: {}
            },
            "DIS20": {
                name: [ "관악구", "관악", "구" ],
                sub: {}
            },
            "DIS21": {
                name: [ "서초구", "서초", "구" ],
                sub: {}
            },
            "DIS22": {
                name: [ "강남구", "강남", "구" ],
                sub: {}
            },
            "DIS23": {
                name: [ "송파구", "송파", "구" ],
                sub: {}
            },
            "DIS24": {
                name: [ "강동구", "강동", "구" ],
                sub: {}
            }
        }
    },
    "BUS": {
        name: [ "부산시", "부산", "광역시" ],
        sub: {
            "BUS": {
                name: [ "시내지역", "시내", "시내지역" ],
                sub: {}
            },
            "DRA": {
                name: [ "기장군", "기장", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "기장읍", "기장", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "장안읍", "장안", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "정관읍", "정관", "읍" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "일광읍", "일광", "읍" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "철마면", "철마", "면" ],
                        sub: {}
                    },
                }
            },
            "DIS0": {
                name: [ "중구", "중", "구" ],
                sub: {}
            },
            "DIS1": {
                name: [ "서구", "서", "구" ],
                sub: {}
            },
            "DIS2": {
                name: [ "동구", "동", "구" ],
                sub: {}
            },
            "DIS3": {
                name: [ "영도구", "영도", "구" ],
                sub: {}
            },
            "DIS4": {
                name: [ "부산진구", "부산진", "구" ],
                sub: {}
            },
            "DIS5": {
                name: [ "동래구", "동래", "구" ],
                sub: {}
            },
            "DIS6": {
                name: [ "남구", "남", "구" ],
                sub: {}
            },
            "DIS7": {
                name: [ "북구", "북", "구" ],
                sub: {}
            },
            "DIS8": {
                name: [ "해운대구", "해운대", "구" ],
                sub: {}
            },
            "DIS9": {
                name: [ "사하구", "사하", "구" ],
                sub: {}
            },
            "DIS10": {
                name: [ "금정구", "금정", "구" ],
                sub: {}
            },
            "DIS11": {
                name: [ "강서구", "강서", "구" ],
                sub: {}
            },
            "DIS12": {
                name: [ "연제구", "연제", "구" ],
                sub: {}
            },
            "DIS13": {
                name: [ "수영구", "수영", "구" ],
                sub: {}
            },
            "DIS14": {
                name: [ "사상구", "사상", "구" ],
                sub: {}
            }
        }
    },
    "DAE": {
        name: [ "대구시", "대구", "광역시" ],
        sub: {
            "DAE": {
                name: [ "시내지역", "시내", "시내지역" ],
                sub: {}
            },
            "DAL": {
                name: [ "달성군", "달성", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "논공읍", "논공", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "다사읍", "다사", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "옥포읍", "옥포", "읍" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "유가읍", "유가", "읍" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "현풍읍", "현풍", "읍" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "화원읍", "화원", "읍" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "가창면", "가창", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "구지면", "구지", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "하빈면", "하빈", "면" ],
                        sub: {}
                    }
                }
            },
            "GWI": {
                name: [ "군위군", "군위", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "군위읍", "군위", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "부계면", "부계", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "산성면", "산성", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "삼국유사면", "삼국유사", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "소보면", "소보", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "우보면", "우보", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "의흥면", "의흥", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "효령면", "효령", "면" ],
                        sub: {}
                    }
                }
            },
            "DIS0": {
                name: [ "중구", "중", "구" ],
                sub: {}
            },
            "DIS1": {
                name: [ "동구", "동", "구" ],
                sub: {}
            },
            "DIS2": {
                name: [ "서구", "서", "구" ],
                sub: {}
            },
            "DIS3": {
                name: [ "남구", "남", "구" ],
                sub: {}
            },
            "DIS4": {
                name: [ "북구", "북", "구" ],
                sub: {}
            },
            "DIS5": {
                name: [ "수성구", "수성", "구" ],
                sub: {}
            },
            "DIS6": {
                name: [ "달서구", "달서", "구" ],
                sub: {}
            }
        }
    },
    "INC": {
        name: [ "인천시", "인천", "광역시" ],
        sub: {
            "INC": {
                name: [ "시내지역", "시내", "시내지역" ],
                sub: {}
            },
            "GHW": {
                name: [ "강화군", "강화", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "강화읍", "강화", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "교동면", "교동", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "길상면", "길상", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "내가면", "내가", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "불은면", "불은", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "삼산면", "삼산", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "서도면", "서도", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "선원면", "선원", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "송해면", "송해", "면" ],
                        sub: {}
                    },
                    "VIL9": {
                        name: [ "양도면", "양도", "면" ],
                        sub: {}
                    },
                    "VIL10": {
                        name: [ "양사면", "양사", "면" ],
                        sub: {}
                    },
                    "VIL11": {
                        name: [ "하점면", "하점", "면" ],
                        sub: {}
                    },
                    "VIL12": {
                        name: [ "화도면", "화도", "면" ],
                        sub: {}
                    }
                }
            },
            "OJI": {
                name: [ "옹진군", "옹진", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "대청면", "대청", "면" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "덕적면", "덕적", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "백령면", "백령", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "북도면", "북도", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "연평면", "연평", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "영흥면", "영흥", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "자월면", "자월", "면" ],
                        sub: {}
                    }
                }
            },
            "DIS0": {
                name: [ "중구", "중", "구" ],
                sub: {}
            },
            "DIS1": {
                name: [ "동구", "동", "구" ],
                sub: {}
            },
            "DIS2": {
                name: [ "미추홀구", "미추홀", "구" ],
                sub: {}
            },
            "DIS3": {
                name: [ "연수구", "연수", "구" ],
                sub: {}
            },
            "DIS4": {
                name: [ "남동구", "남동", "구" ],
                sub: {}
            },
            "DIS5": {
                name: [ "부평구", "부평", "구" ],
                sub: {}
            },
            "DIS6": {
                name: [ "계양구", "계양", "구" ],
                sub: {}
            },
            "DIS7": {
                name: [ "서구", "서", "구" ],
                sub: {}
            }
        }
    },
    "GWJ": {
        name: [ "광주시", "광주", "광역시" ],
        sub: {
            "DIS0": {
                name: [ "동구", "동", "구" ],
                sub: {}
            },
            "DIS1": {
                name: [ "서구", "서", "구" ],
                sub: {}
            },
            "DIS2": {
                name: [ "남구", "남", "구" ],
                sub: {}
            },
            "DIS3": {
                name: [ "북구", "북", "구" ],
                sub: {}
            },
            "DIS4": {
                name: [ "광산구", "광산", "구" ],
                sub: {}
            }
        }
    },
    "DJN": {
        name: [ "대전시", "대전", "광역시" ],
        sub: {
            "DIS0": {
                name: [ "동구", "동", "구" ],
                sub: {}
            },
            "DIS1": {
                name: [ "중구", "중", "구" ],
                sub: {}
            },
            "DIS2": {
                name: [ "서구", "서", "구" ],
                sub: {}
            },
            "DIS3": {
                name: [ "유성구", "유성", "구" ],
                sub: {}
            },
            "DIS4": {
                name: [ "대덕구", "대덕", "구" ],
                sub: {}
            }
        }
    },
    "ULS": {
        name: [ "울산시", "울산", "광역시" ],
        sub: {
            "ULS": {
                name: [ "시내지역", "시내", "시내지역" ],
                sub: {}
            },
            "ULJ": {
                name: [ "울주군", "울주", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "범서읍", "범서", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "언양읍", "언양", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "온산읍", "온산", "읍" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "온양읍", "온양", "읍" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "청량읍", "청량", "읍" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "삼남읍", "삼남", "읍" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "두서면", "두서", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "두동면", "두동", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "삼동면", "삼동", "면" ],
                        sub: {}
                    },
                    "VIL9": {
                        name: [ "상북면", "상북", "면" ],
                        sub: {}
                    },
                    "VIL10": {
                        name: [ "서생면", "서생", "면" ],
                        sub: {}
                    },
                    "VIL11": {
                        name: [ "웅촌면", "웅촌", "면" ],
                        sub: {}
                    }
                }
            },
            "DIS0": {
                name: [ "중구", "중", "구" ],
                sub: {}
            },
            "DIS1": {
                name: [ "남구", "남", "구" ],
                sub: {}
            },
            "DIS2": {
                name: [ "동구", "동", "구" ],
                sub: {}
            },
            "DIS3": {
                name: [ "북구", "북", "구" ],
                sub: {}
            }
        }
    },
    "SEJ": {
        name: [ "세종시", "세종", "특별자치시" ],
        sub: {
            "URBAN": {
                name: [ "시내지역", "시내", "시내지역" ],
                sub: {}
            },
            "RURAL": {
                name: [ "시외지역", "시외", "시외지역" ],
                sub: {}
            },
            "VIL0": {
                name: [ "조치원읍", "조치원", "읍" ],
                sub: {}
            },
            "VIL1": {
                name: [ "금남면", "금남", "면" ],
                sub: {}
            },
            "VIL2": {
                name: [ "부강면", "부강", "면" ],
                sub: {}
            },
            "VIL3": {
                name: [ "소정면", "소정", "면" ],
                sub: {}
            },
            "VIL4": {
                name: [ "연기면", "연기", "면" ],
                sub: {}
            },
            "VIL5": {
                name: [ "연동면", "연동", "면" ],
                sub: {}
            },
            "VIL6": {
                name: [ "연서면", "연서", "면" ],
                sub: {}
            },
            "VIL7": {
                name: [ "장군면", "장군", "면" ],
                sub: {}
            },
            "VIL8": {
                name: [ "전동면", "전동", "면" ],
                sub: {}
            },
            "VIL9": {
                name: [ "전의면", "전의", "면" ],
                sub: {}
            }
        }
    },
    "SGG": {
        name: [ "경기도", "경기", "도" ],
        sub: {
            "GOY": {
                name: [ "고양시", "고양", "시" ],
                sub: {
                    "DIS0": {
                        name: [ "덕양구", "덕양", "구" ],
                        sub: {}
                    },
                    "DIS1": {
                        name: [ "일산동", "일산동", "구" ],
                        sub: {}
                    },
                    "DIS2": {
                        name: [ "일산서", "일산서", "구" ],
                        sub: {}
                    }
                }
            },
            "SUW": {
                name: [ "수원시", "수원", "시" ],
                sub: {
                    "DIS0": {
                        name: [ "장안구", "장안", "구" ],
                        sub: {}
                    },
                    "DIS1": {
                        name: [ "권선구", "권선", "구" ],
                        sub: {}
                    },
                    "DIS2": {
                        name: [ "팔달구", "팔달", "구" ],
                        sub: {}
                    },
                    "DIS3": {
                        name: [ "영통구", "영통", "구" ],
                        sub: {}
                    }
                }
            },
            "YIN": {
                name: [ "용인시", "용인", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "DIS0": {
                        name: [ "처인구", "처인", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS1": {
                        name: [ "기흥구", "기흥", "구" ],
                        sub: {}
                    },
                    "DIS2": {
                        name: [ "수지구", "수지", "구" ],
                        sub: {}
                    }
                }
            },
            "GCN": {
                name: [ "과천시", "과천", "시" ],
                sub: {}
            },
            "GWM": {
                name: [ "광명시", "광명", "시" ],
                sub: {}
            },
            "GGJ": {
                name: [ "광주시", "광주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GRI": {
                name: [ "구리시", "구리", "시" ],
                sub: {}
            },
            "GNP": {
                name: [ "군포시", "군포", "시" ],
                sub: {}
            },
            "GMP": {
                name: [ "김포시", "김포", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "NAM": {
                name: [ "남양주시", "남양주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "DDC": {
                name: [ "동두천시", "동두천", "시" ],
                sub: {}
            },
            "BUC": {
                name: [ "부천시", "부천", "시" ],
                sub: {
                    "DIS0": {
                        name: [ "원미구", "원미", "구" ],
                        sub: {}
                    },
                    "DIS1": {
                        name: [ "소사구", "소사", "구" ],
                        sub: {}
                    },
                    "DIS2": {
                        name: [ "오정구", "오정", "구" ],
                        sub: {}
                    }
                }
            },
            "SNM": {
                name: [ "성남시", "성남", "시" ],
                sub: {
                    "DIS0": {
                        name: [ "수정구", "수정", "구" ],
                        sub: {}
                    },
                    "DIS1": {
                        name: [ "중원구", "중원", "구" ],
                        sub: {}
                    },
                    "DIS2": {
                        name: [ "분당구", "분당", "구" ],
                        sub: {}
                    }
                }
            },
            "SIH": {
                name: [ "시흥시", "시흥", "시" ],
                sub: {}
            },
            "ANS": {
                name: [ "안산시", "안산", "시" ],
                sub: {
                    "DIS0": {
                        name: [ "상록구", "상록", "구" ],
                        sub: {}
                    },
                    "DIS1": {
                        name: [ "단원구", "단원", "구" ],
                        sub: {}
                    }
                }
            },
            "ASN": {
                name: [ "안성시", "안성", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "ANY": {
                name: [ "안양시", "안양", "시" ],
                sub: {
                    "DIS0": {
                        name: [ "동안구", "동안", "구" ],
                        sub: {}
                    },
                    "DIS1": {
                        name: [ "만안구", "만안", "구" ],
                        sub: {}
                    }
                }
            },
            "YNJ": {
                name: [ "양주시", "양주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "YEJ": {
                name: [ "여주시", "여주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "OSN": {
                name: [ "오산시", "오산", "시" ],
                sub: {}
            },
            "UIW": {
                name: [ "의왕시", "의왕", "시" ],
                sub: {}
            },
            "UIJ": {
                name: [ "의정부시", "의정부", "시" ],
                sub: {}
            },
            "ICH": {
                name: [ "이천시", "이천", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "PAJ": {
                name: [ "파주시", "파주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "PTK": {
                name: [ "평택시", "평택", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "PCH": {
                name: [ "포천시", "포천", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "HAN": {
                name: [ "하남시", "하남", "시" ],
                sub: {}
            },
            "HWA": {
                name: [ "화성시", "화성", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GAP": {
                name: [ "가평군", "가평", "군" ],
                sub: {}
            },
            "YNP": {
                name: [ "양평군", "양평", "군" ],
                sub: {}
            },
            "YCN": {
                name: [ "연천군", "연천", "군" ],
                sub: {}
            },
        }
    },
    "NCC": {
        name: [ "충청북도", "충북", "도" ],
        sub: {
            "JEC": {
                name: [ "제천시", "제천", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "CEJ": {
                name: [ "청주시", "청주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "DIS0": {
                        name: [ "상당구", "상당", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS1": {
                        name: [ "서원구", "서원", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS2": {
                        name: [ "흥덕구", "흥덕", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS3": {
                        name: [ "청원구", "청원", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    }
                }
            },
            "CUJ": {
                name: [ "충주시", "충주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GOE": {
                name: [ "괴산군", "괴산", "군" ],
                sub: {}
            },
            "DAN": {
                name: [ "단양군", "단양", "군" ],
                sub: {}
            },
            "BON": {
                name: [ "보은군", "보은", "군" ],
                sub: {}
            },
            "YDN": {
                name: [ "영동군", "영동", "군" ],
                sub: {}
            },
            "OKC": {
                name: [ "옥천군", "옥천", "군" ],
                sub: {}
            },
            "EUM": {
                name: [ "음성군", "음성", "군" ],
                sub: {}
            },
            "JUN": {
                name: [ "증평군", "증평", "군" ],
                sub: {}
            },
            "JIN": {
                name: [ "진천군", "진천", "군" ],
                sub: {}
            }
        }
    },
    "SCC": {
        name: [ "충청남도", "충남", "도" ],
        sub: {
            "GRY": {
                name: [ "계룡시", "계룡", "시" ],
                sub: {}
            },
            "GGJ": {
                name: [ "공주시", "공주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "NNN": {
                name: [ "논산시", "논산", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "DJI": {
                name: [ "당진시", "당진", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "BRY": {
                name: [ "보령시", "보령", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "SES": {
                name: [ "서산시", "서산", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "ASA": {
                name: [ "아산시", "아산", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "CAN": {
                name: [ "천안시", "천안", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "DIS0": {
                        name: [ "동남구", "동남", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS1": {
                        name: [ "서북구", "서북", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    }
                }
            },
            "GSA": {
                name: [ "금산군", "금산", "군" ],
                sub: {}
            },
            "BYO": {
                name: [ "부여군", "부여", "군" ],
                sub: {}
            },
            "SEO": {
                name: [ "서천군", "서천", "군" ],
                sub: {}
            },
            "YSA": {
                name: [ "예산군", "예산", "군" ],
                sub: {}
            },
            "CHY": {
                name: [ "청양군", "청양", "군" ],
                sub: {}
            },
            "TAE": {
                name: [ "태안군", "태안", "군" ],
                sub: {}
            },
            "HNS": {
                name: [ "홍성군", "홍성", "군" ],
                sub: {}
            }
        }
    },
    "NJE": {
        name: [ "전라북도", "전북", "특별자치도" ],
        sub: {
            "GUN": {
                name: [ "군산시", "군산", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GIJ": {
                name: [ "김제시", "김제", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "NWO": {
                name: [ "남원시", "남원", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "IKS": {
                name: [ "익산시", "익산", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "JNJ": {
                name: [ "전주시", "전주", "시" ],
                sub: {
                    "DIS0": {
                        name: [ "완산구", "완산", "구" ],
                        sub: {}
                    },
                    "DIS1": {
                        name: [ "덕진구", "덕진", "구" ],
                        sub: {}
                    }
                }
            },
            "JGP": {
                name: [ "정읍시", "정읍", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GCH": {
                name: [ "고창군", "고창", "군" ],
                sub: {}
            },
            "MUJ": {
                name: [ "무주군", "무주", "군" ],
                sub: {}
            },
            "BUA": {
                name: [ "부안군", "부안", "군" ],
                sub: {}
            },
            "SUC": {
                name: [ "순창군", "순창", "군" ],
                sub: {}
            },
            "WAN": {
                name: [ "완주군", "완주", "군" ],
                sub: {}
            },
            "IMS": {
                name: [ "임실군", "임실", "군" ],
                sub: {}
            },
            "JAS": {
                name: [ "장수군", "장수", "군" ],
                sub: {}
            },
            "JAN": {
                name: [ "진안군", "진안", "군" ],
                sub: {}
            }
        }
    },
    "SJE": {
        name: [ "전라남도", "전남", "도" ],
        sub: {
            "MOK": {
                name: [ "목포시", "목포", "시" ],
                sub: {}
            },
            "YSU": {
                name: [ "여수시", "여수", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "SUN": {
                name: [ "순천시", "순천", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "NAJ": {
                name: [ "나주시", "나주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GWY": {
                name: [ "광양시", "광양", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "DMY": {
                name: [ "담양군", "담양", "군" ],
                sub: {}
            },
            "GOK": {
                name: [ "곡성군", "곡성", "군" ],
                sub: {}
            },
            "GUR": {
                name: [ "구례군", "구례", "군" ],
                sub: {}
            },
            "GOH": {
                name: [ "고흥군", "고흥", "군" ],
                sub: {}
            },
            "BOS": {
                name: [ "보성군", "보성", "군" ],
                sub: {}
            },
            "HWS": {
                name: [ "화순군", "화순", "군" ],
                sub: {}
            },
            "JAH": {
                name: [ "장흥군", "장흥", "군" ],
                sub: {}
            },
            "GJI": {
                name: [ "강진군", "강진", "군" ],
                sub: {}
            },
            "HAE": {
                name: [ "해남군", "해남", "군" ],
                sub: {}
            },
            "YAM": {
                name: [ "영암군", "영암", "군" ],
                sub: {}
            },
            "MAN": {
                name: [ "무안군", "무안", "군" ],
                sub: {}
            },
            "HPY": {
                name: [ "함평군", "함평", "군" ],
                sub: {}
            },
            "YGW": {
                name: [ "영광군", "영광", "군" ],
                sub: {}
            },
            "JSO": {
                name: [ "장성군", "장성", "군" ],
                sub: {}
            },
            "WDO": {
                name: [ "완도군", "완도", "군" ],
                sub: {}
            },
            "JDO": {
                name: [ "진도군", "진도", "군" ],
                sub: {}
            },
            "SIA": {
                name: [ "신안군", "신안", "군" ],
                sub: {}
            }
        }
    },
    "NGS": {
        name: [ "경상북도", "경북", "도" ],
        sub: {
            "GES": {
                name: [ "경산시", "경산", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "WOL": {
                name: [ "경주시", "경주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GUM": {
                name: [ "구미시", "구미", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GIM": {
                name: [ "김천시", "김천", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "JMC": {
                name: [ "문경시", "문경", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "SJU": {
                name: [ "상주시", "상주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "AND": {
                name: [ "안동시", "안동", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "YGJ": {
                name: [ "영주시", "영주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "YCN": {
                name: [ "영천시", "영천", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "POH": {
                name: [ "포항시", "포항", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "DIS0": {
                        name: [ "남구", "남", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS1": {
                        name: [ "북구", "북", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    }
                }
            },
            "GRG": {
                name: [ "고령군", "고령", "군" ],
                sub: {}
            },
            "BHW": {
                name: [ "봉화군", "봉화", "군" ],
                sub: {}
            },
            "SGU": {
                name: [ "성주군", "성주", "군" ],
                sub: {}
            },
            "YDK": {
                name: [ "영덕군", "영덕", "군" ],
                sub: {}
            },
            "YYG": {
                name: [ "영양군", "영양", "군" ],
                sub: {}
            },
            "YEC": {
                name: [ "예천군", "예천", "군" ],
                sub: {}
            },
            "ULL": {
                name: [ "울릉군", "울릉", "군" ],
                sub: {}
            },
            "UJN": {
                name: [ "울진군", "울진", "군" ],
                sub: {}
            },
            "UIG": {
                name: [ "의성군", "의성", "군" ],
                sub: {}
            },
            "CDO": {
                name: [ "청도군", "청도", "군" ],
                sub: {}
            },
            "CON": {
                name: [ "청송군", "청송", "군" ],
                sub: {}
            },
            "COK": {
                name: [ "칠곡군", "칠곡", "군" ],
                sub: {}
            }
        }
    },
    "SGS": {
        name: [ "경상남도", "경남", "도" ],
        sub: {
            "CWN": {
                name: [ "창원시", "창원", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "DIS0": {
                        name: [ "의창구", "의창", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS1": {
                        name: [ "성산구", "성산", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS2": {
                        name: [ "마산합포구", "마산합포", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS3": {
                        name: [ "마산회원구", "마산회원", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    },
                    "DIS4": {
                        name: [ "진해구", "진해", "구" ],
                        sub: {
                            "URBAN": {
                                name: [ "시내지역", "시내", "시내지역" ],
                                sub: {}
                            },
                            "RURAL": {
                                name: [ "시외지역", "시외", "시외지역" ],
                                sub: {}
                            }
                        }
                    }
                }
            },
            "GJE": {
                name: [ "거제시", "거제", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GAE": {
                name: [ "김해시", "김해", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "MRY": {
                name: [ "밀양시", "밀양", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "SAC": {
                name: [ "사천시", "사천", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "YAS": {
                name: [ "양산시", "양산", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "JIJ": {
                name: [ "진주시", "진주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "CHM": {
                name: [ "통영시", "통영", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    }
                }
            },
            "GEC": {
                name: [ "거창군", "거창", "군" ],
                sub: {}
            },
            "GSE": {
                name: [ "고성군", "고성", "군" ],
                sub: {}
            },
            "NHE": {
                name: [ "남해군", "남해", "군" ],
                sub: {}
            },
            "SCG": {
                name: [ "산청군", "산청", "군" ],
                sub: {}
            },
            "URY": {
                name: [ "의령군", "의령", "군" ],
                sub: {}
            },
            "NYE": {
                name: [ "창녕군", "창녕", "군" ],
                sub: {}
            },
            "HAD": {
                name: [ "하동군", "하동", "군" ],
                sub: {}
            },
            "HMN": {
                name: [ "함안군", "함안", "군" ],
                sub: {}
            },
            "HYG": {
                name: [ "함양군", "함양", "군" ],
                sub: {}
            },
            "PCH": {
                name: [ "합천군", "합천", "군" ],
                sub: {}
            }
        }
    },
    "GWN": {
        name: [ "강원도", "강원", "특별자치도" ],
        sub: {
            "GGG": {
                name: [ "강릉시", "강릉", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "VIL0": {
                        name: [ "주문진읍", "주문진", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "강동면", "강동", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "구정면", "구정", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "사천면", "사천", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "성산면", "성산", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "연곡면", "연곡", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "옥계면", "옥계", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "왕산면", "왕산", "면" ],
                        sub: {}
                    }
                }
            },
            "DHE": {
                name: [ "동해시", "동해", "시" ],
                sub: {}
            },
            "SAK": {
                name: [ "삼척시", "삼척", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "VIL0": {
                        name: [ "도계읍", "도계", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "원덕읍", "원덕", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "가곡면", "가곡", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "근덕면", "근덕", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "노곡면", "노곡", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "미로면", "미로", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "신기면", "신기", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "하장면", "하장", "면" ],
                        sub: {}
                    }
                }
            },
            "SKC": {
                name: [ "속초시", "속초", "시" ],
                sub: {}
            },
            "WON": {
                name: [ "원주시", "원주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "VIL0": {
                        name: [ "문막읍", "문막", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "귀래면", "귀래", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "부론면", "부론", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "소초면", "소초", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "신림면", "신림", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "지정면", "지정", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "판부면", "판부", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "호저면", "호저", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "흥업면", "흥업", "면" ],
                        sub: {}
                    }
                }
            },
            "CCH": {
                name: [ "춘천시", "춘천", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "VIL0": {
                        name: [ "신북읍", "신북", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "남면", "남", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "남산면", "남산", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "동면", "동", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "동내면", "동내", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "동산면", "동산", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "북산면", "북산", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "사북면", "사북", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "서면", "서", "면" ],
                        sub: {}
                    },
                    "VIL9": {
                        name: [ "신동면", "신동", "면" ],
                        sub: {}
                    }
                }
            },
            "TBK": {
                name: [ "태백시", "태백", "시" ],
                sub: {}
            },
            "GSO": {
                name: [ "고성군", "고성", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "간성읍", "간성", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "거진읍", "거진", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "현내면", "현내", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "죽왕면", "죽왕", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "토성면", "토성", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "수동면", "수동", "면" ],
                        sub: {}
                    }
                }
            },
            "YGG": {
                name: [ "양구군", "양구", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "양구읍", "양구", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "국토정중앙면", "국토정중앙", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "동면", "동", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "방산면", "방산", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "해안면", "해안", "면" ],
                        sub: {}
                    }
                }
            },
            "YYG": {
                name: [ "양양군", "양양", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "양양읍", "양양", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "강현면", "강현", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "서면", "서", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "손양면", "손양", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "현북면", "현북", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "현남면", "현남", "면" ],
                        sub: {}
                    }
                }
            },
            "YWL": {
                name: [ "영월군", "영월", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "영월읍", "영월", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "상동읍", "상동", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "김삿갓면", "김삿갓", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "남면", "남", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "무릉도원면", "무릉도원", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "북면", "북", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "산솔면", "산솔", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "주천면", "주천", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "한반도면", "한반도", "면" ],
                        sub: {}
                    }
                }
            },
            "INJ": {
                name: [ "인제군", "인제", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "인제읍", "인제", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "기린면", "기린", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "남면", "남", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "북면", "북", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "상남면", "상남", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "서화면", "서화", "면" ],
                        sub: {}
                    }
                }
            },
            "JSN": {
                name: [ "정선군", "정선", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "고한읍", "고한", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "사북읍", "사북", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "신동읍", "신동", "읍" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "정선읍", "정선", "읍" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "남면", "남", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "북평면", "북평", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "여량면", "여량", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "임계면", "임계", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "화암면", "화암", "면" ],
                        sub: {}
                    }
                }
            },
            "CRW": {
                name: [ "철원군", "철원", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "갈말읍", "갈말", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "김화읍", "김화", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "동송읍", "동송", "읍" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "철원읍", "철원", "읍" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "근남면", "근남", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "근북면", "근북", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "서면", "서", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "근동면", "근동", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "원남면", "원남", "면" ],
                        sub: {}
                    },
                    "VIL9": {
                        name: [ "원동면", "원동", "면" ],
                        sub: {}
                    },
                    "VIL10": {
                        name: [ "임남면", "임남", "면" ],
                        sub: {}
                    }
                }
            },
            "PYC": {
                name: [ "평창군", "평창", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "평창읍", "평창", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "미탄면", "미탄", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "방림면", "방림", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "대화면", "대화", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "봉평면", "봉평", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "용평면", "용평", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "진부면", "진부", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "대관령면", "대관령", "면" ],
                        sub: {}
                    }
                }
            },
            "HCH": {
                name: [ "홍천군", "홍천", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "홍천읍", "홍천", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "화촌면", "화촌", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "두촌면", "두촌", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "내촌면", "내촌", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "서석면", "서석", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "영귀미면", "영귀미", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "남면", "남", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "서면", "서", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "북방면", "북방", "면" ],
                        sub: {}
                    },
                    "VIL9": {
                        name: [ "내면", "내", "면" ],
                        sub: {}
                    }
                }
            },
            "HWH": {
                name: [ "화천군", "화천", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "화천읍", "화천", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "간동면", "간동", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "사내면", "사내", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "상서면", "상서", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "하남면", "하남", "면" ],
                        sub: {}
                    }
                }
            },
            "HOE": {
                name: [ "횡성군", "횡성", "군" ],
                sub: {
                    "VIL0": {
                        name: [ "횡성읍", "횡성", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "갑천면", "갑천", "면" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "강림면", "강림", "면" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "공근면", "공근", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "둔내면", "둔내", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "서원면", "서원", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "안흥면", "안흥", "면" ],
                        sub: {}
                    },
                    "VIL7": {
                        name: [ "우천면", "우천", "면" ],
                        sub: {}
                    },
                    "VIL8": {
                        name: [ "청일면", "청일", "면" ],
                        sub: {}
                    }
                }
            }
        }
    },
    "JJU": {
        name: [ "제주도", "제주", "특별자치도" ],
        sub: {
            "JCT": {
                name: [ "제주시", "제주", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "VIL0": {
                        name: [ "구좌읍", "구좌", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "애월읍", "애월", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "조천읍", "조천", "읍" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "한림읍", "한림", "읍" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "우도면", "우도", "면" ],
                        sub: {}
                    },
                    "VIL5": {
                        name: [ "추자면", "추자", "면" ],
                        sub: {}
                    },
                    "VIL6": {
                        name: [ "한경면", "한경", "면" ],
                        sub: {}
                    }
                }
            },
            "GWP": {
                name: [ "서귀포시", "서귀포", "시" ],
                sub: {
                    "URBAN": {
                        name: [ "시내지역", "시내", "시내지역" ],
                        sub: {}
                    },
                    "RURAL": {
                        name: [ "시외지역", "시외", "시외지역" ],
                        sub: {}
                    },
                    "VIL0": {
                        name: [ "남원읍", "남원", "읍" ],
                        sub: {}
                    },
                    "VIL1": {
                        name: [ "대정읍", "대정", "읍" ],
                        sub: {}
                    },
                    "VIL2": {
                        name: [ "성산읍", "성산", "읍" ],
                        sub: {}
                    },
                    "VIL3": {
                        name: [ "안덕면", "안덕", "면" ],
                        sub: {}
                    },
                    "VIL4": {
                        name: [ "표선면", "표선", "면" ],
                        sub: {}
                    }
                }
            },
        }
    },
    "XNG": {
        name: [ "미수복경기도", "미수복경기", "도" ],
        sub: {
            "XNG0": {
                name: [ "연천군", "연천", "군" ],
                sub: {}
            },
            "XNG1": {
                name: [ "개성시", "개성", "시" ],
                sub: {}
            },
            "XNG2": {
                name: [ "개풍군", "개풍", "군" ],
                sub: {}
            },
            "XNG3": {
                name: [ "장단군", "장단", "군" ],
                sub: {}
            }
        }
    },
    "XGW": {
        name: [ "미수복강원도", "미수복강원", "도" ],
        sub: {
            "XGW0": {
                name: [ "고성군", "고성", "군" ],
                sub: {}
            },
            "XGW1": {
                name: [ "양구군", "양구", "군" ],
                sub: {}
            },
            "XGW2": {
                name: [ "인제군", "인제", "군" ],
                sub: {}
            },
            "XGW3": {
                name: [ "철원군", "철원", "군" ],
                sub: {}
            },
            "XGW4": {
                name: [ "김화군", "김화", "군" ],
                sub: {}
            },
            "XGW5": {
                name: [ "이천군", "이천", "군" ],
                sub: {}
            },
            "XGW6": {
                name: [ "통천군", "통천", "군" ],
                sub: {}
            },
            "XGW7": {
                name: [ "평강군", "평강", "군" ],
                sub: {}
            },
            "XGW8": {
                name: [ "회양군", "회양", "군" ],
                sub: {}
            }
        }
    },
    "XHW": {
        name: [ "황해도", "황해", "도" ],
        sub: {
            "XHW0": {
                name: [ "해주시", "해주", "시" ],
                sub: {}
            },
            "XHW1": {
                name: [ "사리원시", "사리원", "시" ],
                sub: {}
            },
            "XHW2": {
                name: [ "송림시", "송림", "시" ],
                sub: {}
            },
            "XHW3": {
                name: [ "벽성군", "벽성", "군" ],
                sub: {}
            },
            "XHW4": {
                name: [ "연백군", "연백", "군" ],
                sub: {}
            },
            "XHW5": {
                name: [ "금천군", "금천", "군" ],
                sub: {}
            },
            "XHW6": {
                name: [ "평산군", "평산", "군" ],
                sub: {}
            },
            "XHW7": {
                name: [ "신계군", "신계", "군" ],
                sub: {}
            },
            "XHW8": {
                name: [ "장연군", "장연", "군" ],
                sub: {}
            },
            "XHW9": {
                name: [ "송화군", "송화", "군" ],
                sub: {}
            },
            "XHW10": {
                name: [ "은율군", "은율", "군" ],
                sub: {}
            },
            "XHW11": {
                name: [ "안악군", "안악", "군" ],
                sub: {}
            },
            "XHW12": {
                name: [ "신천군", "신천", "군" ],
                sub: {}
            },
            "XHW13": {
                name: [ "재령군", "재령", "군" ],
                sub: {}
            },
            "XHW14": {
                name: [ "황주군", "황주", "군" ],
                sub: {}
            },
            "XHW15": {
                name: [ "봉산군", "봉산", "군" ],
                sub: {}
            },
            "XHW16": {
                name: [ "서흥군", "서흥", "군" ],
                sub: {}
            },
            "XHW17": {
                name: [ "수안군", "수안", "군" ],
                sub: {}
            },
            "XHW18": {
                name: [ "곡산군", "곡산", "군" ],
                sub: {}
            },
            "XHW19": {
                name: [ "옹진군", "옹진", "군" ],
                sub: {}
            }
        }
    },
    "XNP": {
        name: [ "평안북도", "평북", "도" ],
        sub: {
            "XNP0": {
                name: [ "신의주시", "신의주", "시" ],
                sub: {}
            },
            "XNP1": {
                name: [ "의주군", "의주", "군" ],
                sub: {}
            },
            "XNP2": {
                name: [ "용천군", "용천", "군" ],
                sub: {}
            },
            "XNP3": {
                name: [ "철산군", "철산", "군" ],
                sub: {}
            },
            "XNP4": {
                name: [ "선천군", "선천", "군" ],
                sub: {}
            },
            "XNP5": {
                name: [ "강계군", "강계", "군" ],
                sub: {}
            },
            "XNP6": {
                name: [ "정주군", "정주", "군" ],
                sub: {}
            },
            "XNP7": {
                name: [ "박천군", "박천", "군" ],
                sub: {}
            },
            "XNP8": {
                name: [ "태천군", "태천", "군" ],
                sub: {}
            },
            "XNP9": {
                name: [ "영변군", "영변", "군" ],
                sub: {}
            },
            "XNP10": {
                name: [ "자성군", "자성", "군" ],
                sub: {}
            },
            "XNP11": {
                name: [ "운산군", "운산", "군" ],
                sub: {}
            },
            "XNP12": {
                name: [ "구성군", "구성", "군" ],
                sub: {}
            },
            "XNP13": {
                name: [ "창성군", "창성", "군" ],
                sub: {}
            },
            "XNP14": {
                name: [ "벽동군", "벽동", "군" ],
                sub: {}
            },
            "XNP15": {
                name: [ "후창군", "후창", "군" ],
                sub: {}
            },
            "XNP16": {
                name: [ "삭주군", "삭주", "군" ],
                sub: {}
            },
            "XNP17": {
                name: [ "초산군", "초산", "군" ],
                sub: {}
            },
            "XNP18": {
                name: [ "위원군", "위원", "군" ],
                sub: {}
            },
            "XNP19": {
                name: [ "희천군", "희천", "군" ],
                sub: {}
            }
        }
    },
    "XSP": {
        name: [ "평안남도", "평남", "도" ],
        sub: {
            "XSP0": {
                name: [ "평양시", "평양", "시" ],
                sub: {}
            },
            "XSP1": {
                name: [ "진남포시", "진남포", "시" ],
                sub: {}
            },
            "XSP2": {
                name: [ "대동군", "대동", "군" ],
                sub: {}
            },
            "XSP3": {
                name: [ "순천군", "순천", "군" ],
                sub: {}
            },
            "XSP4": {
                name: [ "맹산군", "맹산", "군" ],
                sub: {}
            },
            "XSP5": {
                name: [ "양덕군", "양덕", "군" ],
                sub: {}
            },
            "XSP6": {
                name: [ "덕천군", "덕천", "군" ],
                sub: {}
            },
            "XSP7": {
                name: [ "성천군", "성천", "군" ],
                sub: {}
            },
            "XSP8": {
                name: [ "강동군", "강동", "군" ],
                sub: {}
            },
            "XSP9": {
                name: [ "중화군", "중화", "군" ],
                sub: {}
            },
            "XSP10": {
                name: [ "용강군", "용강", "군" ],
                sub: {}
            },
            "XSP11": {
                name: [ "영원군", "영원", "군" ],
                sub: {}
            },
            "XSP12": {
                name: [ "강서군", "강서", "군" ],
                sub: {}
            },
            "XSP13": {
                name: [ "평원군", "평원", "군" ],
                sub: {}
            },
            "XSP14": {
                name: [ "안주군", "안주", "군" ],
                sub: {}
            },
            "XSP15": {
                name: [ "개천군", "개천", "군" ],
                sub: {}
            }
        }
    },
    "XNH": {
        name: [ "함경북도", "함북", "도" ],
        sub: {
            "XNH0": {
                name: [ "청진시", "청진", "시" ],
                sub: {}
            },
            "XNH1": {
                name: [ "성진시", "성진", "시" ],
                sub: {}
            },
            "XNH2": {
                name: [ "나진시", "나진", "시" ],
                sub: {}
            },
            "XNH3": {
                name: [ "경성군", "경성", "군" ],
                sub: {}
            },
            "XNH4": {
                name: [ "명천군", "명천", "군" ],
                sub: {}
            },
            "XNH5": {
                name: [ "길주군", "길주", "군" ],
                sub: {}
            },
            "XNH6": {
                name: [ "학성군", "학성", "군" ],
                sub: {}
            },
            "XNH7": {
                name: [ "부령군", "부령", "군" ],
                sub: {}
            },
            "XNH8": {
                name: [ "무산군", "무산", "군" ],
                sub: {}
            },
            "XNH9": {
                name: [ "회령군", "회령", "군" ],
                sub: {}
            },
            "XNH10": {
                name: [ "종성군", "종성", "군" ],
                sub: {}
            },
            "XNH11": {
                name: [ "경흥군", "경흥", "군" ],
                sub: {}
            },
            "XNH12": {
                name: [ "경원군", "경원", "군" ],
                sub: {}
            },
            "XNH13": {
                name: [ "온성군", "온성", "군" ],
                sub: {}
            }
        }
    },
    "XSH": {
        name: [ "함경남도", "함남", "도" ],
        sub: {
            "XSH0": {
                name: [ "함흥시", "함흥", "시" ],
                sub: {}
            },
            "XSH1": {
                name: [ "원산시", "원산", "시" ],
                sub: {}
            },
            "XSH2": {
                name: [ "흥남시", "흥남", "시" ],
                sub: {}
            },
            "XSH3": {
                name: [ "함주군", "함주", "군" ],
                sub: {}
            },
            "XSH4": {
                name: [ "정평군", "정평", "군" ],
                sub: {}
            },
            "XSH5": {
                name: [ "영흥군", "영흥", "군" ],
                sub: {}
            },
            "XSH6": {
                name: [ "고원군", "고원", "군" ],
                sub: {}
            },
            "XSH7": {
                name: [ "문천군", "문천", "군" ],
                sub: {}
            },
            "XSH8": {
                name: [ "안변군", "안변", "군" ],
                sub: {}
            },
            "XSH9": {
                name: [ "홍원군", "홍원", "군" ],
                sub: {}
            },
            "XSH10": {
                name: [ "북청군", "북청", "군" ],
                sub: {}
            },
            "XSH11": {
                name: [ "이원군", "이원", "군" ],
                sub: {}
            },
            "XSH12": {
                name: [ "단천군", "단천", "군" ],
                sub: {}
            },
            "XSH13": {
                name: [ "신흥군", "신흥", "군" ],
                sub: {}
            },
            "XSH14": {
                name: [ "장진군", "장진", "군" ],
                sub: {}
            },
            "XSH15": {
                name: [ "풍산군", "풍산", "군" ],
                sub: {}
            },
            "XSH16": {
                name: [ "삼수군", "삼수", "군" ],
                sub: {}
            },
            "XSH17": {
                name: [ "갑산군", "갑산", "군" ],
                sub: {}
            },
            "XSH18": {
                name: [ "혜산군", "혜산", "군" ],
                sub: {}
            }
        }
    }
}